Sphere-1m/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (68.058 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
//         type            pressureInletOutletVelocity;
//         inletValue      uniform (0 0 0);
//         value           uniform (0 0 0);

        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;

//         type            zeroGradient;
    }

    sphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    sides
    {
        type            symmetry;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
