Sphere-1m/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sides
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          10608;
        startFace       3633144;
    }
    inlet
    {
        type            patch;
        nFaces          796;
        startFace       3643752;
    }
    outlet
    {
        type            patch;
        nFaces          796;
        startFace       3644548;
    }
    sphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20016;
        startFace       3645344;
    }
)

// ************************************************************************* //
