Sphere-1m/system/center_line
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

center_line
{
	type            probes;
	functionObjectLibs ("libsampling.so");
	outputControl   timeStep;
	outputInterval  1;
	probeLocations
	(
		(1.00 0 0)
		(1.03 0 0)
		(1.06 0 0)
		(1.09 0 0)
		(1.12 0 0)
		(1.15 0 0)
		(1.18 0 0)
		(1.21 0 0)
		(1.24 0 0)
		(1.27 0 0)
		(1.30 0 0)
		(1.33 0 0)
		(1.36 0 0)
		(1.39 0 0)
		(1.42 0 0)
		(1.45 0 0)
		(1.48 0 0)
		(1.51 0 0)
		(1.54 0 0)
		(1.57 0 0)
		(1.60 0 0)
		(1.63 0 0)
		(1.66 0 0)
		(1.69 0 0)
		(1.72 0 0)
		(1.75 0 0)
		(1.78 0 0)
		(1.81 0 0)
		(1.84 0 0)
		(1.87 0 0)
		(1.90 0 0)
		(1.93 0 0)
		(1.96 0 0)
		(1.99 0 0)
		(2.02 0 0)
		(2.05 0 0)
		(2.08 0 0)
		(2.11 0 0)
		(2.14 0 0)
		(2.17 0 0)
		(2.20 0 0)
		(2.23 0 0)
		(2.26 0 0)
		(2.29 0 0)
		(2.32 0 0)
		(2.35 0 0)
		(2.38 0 0)
		(2.41 0 0)
		(2.44 0 0)
		(2.47 0 0)
		(2.50 0 0)
		(2.53 0 0)
		(2.56 0 0)
		(2.59 0 0)
		(2.62 0 0)
		(2.65 0 0)
		(2.68 0 0)
		(2.71 0 0)
		(2.74 0 0)
		(2.77 0 0)
		(2.80 0 0)
		(2.83 0 0)
		(2.86 0 0)
		(2.89 0 0)
		(2.92 0 0)
		(2.95 0 0)
		(2.98 0 0)
		(3.01 0 0)
		(3.04 0 0)
		(3.07 0 0)
		(3.10 0 0)
		(3.13 0 0)
		(3.16 0 0)
		(3.19 0 0)
		(3.22 0 0)
		(3.25 0 0)
		(3.28 0 0)
		(3.31 0 0)
		(3.34 0 0)
		(3.37 0 0)
		(3.40 0 0)
		(3.43 0 0)
		(3.46 0 0)
		(3.49 0 0)
		(3.52 0 0)
		(3.55 0 0)
		(3.58 0 0)
		(3.61 0 0)
		(3.64 0 0)
		(3.67 0 0)
		(3.70 0 0)
		(3.73 0 0)
		(3.76 0 0)
		(3.79 0 0)
		(3.82 0 0)
		(3.85 0 0)
		(3.88 0 0)
		(3.91 0 0)
		(3.94 0 0)
...
	);
	fields
	(
		U
	);
}

// ************************************************************************* //