Sphere-1m/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//     default         steadyState;
// //     default         Euler;// Lowest precision
    default         backward;// Highest precision
}

gradSchemes
{
    default         Gauss linear;

    grad(nuTilda)   cellLimited Gauss linear 1;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss LUST unlimitedGrad(U);
//     div(phi,U)      Gauss cubic; // Highest precision -> diverges
	
    div(phi,nuTilda) Gauss limitedLinear 1;
// //     div(phi,nuTilda)      Gauss cubic; // Highest precision

//     div((nuEff*dev2(T(grad(U))))) Gauss linear;
	div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
//     default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
//     default         corrected;
}

wallDist
{
    method meshWave;
}

fluxRequired
{
	default         no;
	p;
	Phi;
}


// ************************************************************************* //
