Sphere-1m/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}

solvers
{
    Phi
    {
        solver          GAMG;
        smoother        DIC;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;

        tolerance       1e-06;
        relTol          0.01;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    nuTilda
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0;
    }

    nuTildaFinal
    {
        $nuTilda;
        relTol          0;
    }
}

SIMPLE
{
    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(k|omega|epsilon|nuTilda)" 1e-6;
    }
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 3;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    rhoMin          0.5;
    rhoMax          2.0;
}

relaxationFactors
{
//     fields
//     {   
//         p               0.3;
//     }
//     equations
//     {
//         U               0.7;
//         k               0.7;
//         epsilon         0.7;
//         nuTilda         0.7;
//         omega           0.7;
//     }
    equations
    {
        ".*"  1;
    }
}

// ************************************************************************* //
