Sphere-1m/system/vertical_line_5
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

vertical_line_5
{
	type            probes;
	functionObjectLibs ("libsampling.so");
	outputControl   timeStep;
	outputInterval  1;
	probeLocations
	(
		(5 -2.000 0)
		(5 -1.984 0)
		(5 -1.968 0)
		(5 -1.952 0)
		(5 -1.936 0)
		(5 -1.920 0)
		(5 -1.904 0)
		(5 -1.888 0)
		(5 -1.872 0)
		(5 -1.856 0)
		(5 -1.840 0)
		(5 -1.824 0)
		(5 -1.808 0)
		(5 -1.792 0)
		(5 -1.776 0)
		(5 -1.760 0)
		(5 -1.744 0)
		(5 -1.728 0)
		(5 -1.712 0)
		(5 -1.696 0)
		(5 -1.680 0)
		(5 -1.664 0)
		(5 -1.648 0)
		(5 -1.632 0)
		(5 -1.616 0)
		(5 -1.600 0)
		(5 -1.584 0)
		(5 -1.568 0)
		(5 -1.552 0)
		(5 -1.536 0)
		(5 -1.520 0)
		(5 -1.504 0)
		(5 -1.488 0)
		(5 -1.472 0)
		(5 -1.456 0)
		(5 -1.440 0)
		(5 -1.424 0)
		(5 -1.408 0)
		(5 -1.392 0)
		(5 -1.376 0)
		(5 -1.360 0)
		(5 -1.344 0)
		(5 -1.328 0)
		(5 -1.312 0)
		(5 -1.296 0)
		(5 -1.280 0)
		(5 -1.264 0)
		(5 -1.248 0)
		(5 -1.232 0)
		(5 -1.216 0)
		(5 -1.200 0)
		(5 -1.184 0)
		(5 -1.168 0)
		(5 -1.152 0)
		(5 -1.136 0)
		(5 -1.120 0)
		(5 -1.104 0)
		(5 -1.088 0)
		(5 -1.072 0)
		(5 -1.056 0)
		(5 -1.040 0)
		(5 -1.024 0)
		(5 -1.008 0)
		(5 -0.992 0)
		(5 -0.976 0)
		(5 -0.960 0)
		(5 -0.944 0)
		(5 -0.928 0)
		(5 -0.912 0)
		(5 -0.896 0)
		(5 -0.880 0)
		(5 -0.864 0)
		(5 -0.848 0)
		(5 -0.832 0)
		(5 -0.816 0)
		(5 -0.800 0)
		(5 -0.784 0)
		(5 -0.768 0)
		(5 -0.752 0)
		(5 -0.736 0)
		(5 -0.720 0)
		(5 -0.704 0)
		(5 -0.688 0)
		(5 -0.672 0)
		(5 -0.656 0)
		(5 -0.640 0)
		(5 -0.624 0)
		(5 -0.608 0)
		(5 -0.592 0)
		(5 -0.576 0)
		(5 -0.560 0)
		(5 -0.544 0)
		(5 -0.528 0)
		(5 -0.512 0)
		(5 -0.496 0)
		(5 -0.480 0)
		(5 -0.464 0)
		(5 -0.448 0)
		(5 -0.432 0)
		(5 -0.416 0)
		(5 -0.400 0)
		(5 -0.384 0)
		(5 -0.368 0)
		(5 -0.352 0)
		(5 -0.336 0)
		(5 -0.320 0)
		(5 -0.304 0)
		(5 -0.288 0)
		(5 -0.272 0)
		(5 -0.256 0)
		(5 -0.240 0)
		(5 -0.224 0)
		(5 -0.208 0)
		(5 -0.192 0)
		(5 -0.176 0)
		(5 -0.160 0)
		(5 -0.144 0)
		(5 -0.128 0)
		(5 -0.112 0)
		(5 -0.096 0)
		(5 -0.080 0)
		(5 -0.064 0)
		(5 -0.048 0)
		(5 -0.032 0)
		(5 -0.016 0)
		(5 -0.000 0)
		(5 0.016 0)
		(5 0.032 0)
		(5 0.048 0)
		(5 0.064 0)
		(5 0.080 0)
		(5 0.096 0)
		(5 0.112 0)
		(5 0.128 0)
		(5 0.144 0)
		(5 0.160 0)
		(5 0.176 0)
		(5 0.192 0)
		(5 0.208 0)
		(5 0.224 0)
		(5 0.240 0)
		(5 0.256 0)
		(5 0.272 0)
		(5 0.288 0)
		(5 0.304 0)
		(5 0.320 0)
		(5 0.336 0)
		(5 0.352 0)
		(5 0.368 0)
		(5 0.384 0)
		(5 0.400 0)
		(5 0.416 0)
		(5 0.432 0)
		(5 0.448 0)
		(5 0.464 0)
		(5 0.480 0)
		(5 0.496 0)
		(5 0.512 0)
		(5 0.528 0)
		(5 0.544 0)
		(5 0.560 0)
		(5 0.576 0)
		(5 0.592 0)
		(5 0.608 0)
		(5 0.624 0)
		(5 0.640 0)
		(5 0.656 0)
		(5 0.672 0)
		(5 0.688 0)
		(5 0.704 0)
		(5 0.720 0)
		(5 0.736 0)
		(5 0.752 0)
		(5 0.768 0)
		(5 0.784 0)
		(5 0.800 0)
		(5 0.816 0)
		(5 0.832 0)
		(5 0.848 0)
		(5 0.864 0)
		(5 0.880 0)
		(5 0.896 0)
		(5 0.912 0)
		(5 0.928 0)
		(5 0.944 0)
		(5 0.960 0)
		(5 0.976 0)
		(5 0.992 0)
		(5 1.008 0)
		(5 1.024 0)
		(5 1.040 0)
		(5 1.056 0)
		(5 1.072 0)
		(5 1.088 0)
		(5 1.104 0)
		(5 1.120 0)
		(5 1.136 0)
		(5 1.152 0)
		(5 1.168 0)
		(5 1.184 0)
		(5 1.200 0)
		(5 1.216 0)
		(5 1.232 0)
		(5 1.248 0)
		(5 1.264 0)
		(5 1.280 0)
		(5 1.296 0)
		(5 1.312 0)
		(5 1.328 0)
		(5 1.344 0)
		(5 1.360 0)
		(5 1.376 0)
		(5 1.392 0)
		(5 1.408 0)
		(5 1.424 0)
		(5 1.440 0)
		(5 1.456 0)
		(5 1.472 0)
		(5 1.488 0)
		(5 1.504 0)
		(5 1.520 0)
		(5 1.536 0)
		(5 1.552 0)
		(5 1.568 0)
		(5 1.584 0)
		(5 1.600 0)
		(5 1.616 0)
		(5 1.632 0)
		(5 1.648 0)
		(5 1.664 0)
		(5 1.680 0)
		(5 1.696 0)
		(5 1.712 0)
		(5 1.728 0)
		(5 1.744 0)
		(5 1.760 0)
		(5 1.776 0)
		(5 1.792 0)
		(5 1.808 0)
		(5 1.824 0)
		(5 1.840 0)
		(5 1.856 0)
		(5 1.872 0)
		(5 1.888 0)
		(5 1.904 0)
		(5 1.920 0)
		(5 1.936 0)
		(5 1.952 0)
		(5 1.968 0)
		(5 1.984 0)
		(5 2.000 0)
	);
	fields
	(
		U
	);
}

// ************************************************************************* //
